export const users = [
  {
    id: '001',
    username: 'borzoo',
    password: 'lotus',
    name: 'Borzoo',
    name_fa: 'برزو',
    join_date: '2022-02-10 11:00:00',
    rank: 'intermediate',
    user_plants: {
      count: 1,
      plants: [
        {
          id: '001',
          name: 'Chili',
          name_fa: 'چیلی',
          race: 'Peperomia',
          race_fa: 'پپرومیا',
          birthday: '2020-07-25 00:00:00',
          feeding_water_period_in_days: 10,
        },
      ],
    },
    user_notes: [
      {
        id: '001',
        date: '2020-07-25 00:00:00',
        text: 'این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!',
      },
      {
        id: '002',
        date: '2020-07-26 00:00:00',
        text: 'این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!',
      },
      {
        id: '003',
        date: '2020-07-27 00:00:00',
        text: 'این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!',
      },
      {
        id: '004',
        date: '2020-07-28 00:00:00',
        text: 'این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!',
      },
      {
        id: '005',
        date: '2020-07-29 00:00:00',
        text: 'این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!',
      },
      {
        id: '006',
        date: '2020-07-30 00:00:00',
        text: 'این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!',
      },
      {
        id: '007',
        date: '2020-07-31 00:00:00',
        text: 'این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!این متن برای تست کردن نوشته شده و هیچ ارزش دیگری ندارد !!!',
      },
    ],
  },
];
